In [32]:
import pandas as pd
df = pd.read_csv('titanic_day2.csv')
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare
0,1,0,3,"Braund, Mr. Owen",male,22.0,7.2500
1,2,1,1,"Cumings, Mrs. John",female,38.0,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques",female,35.0,53.1000
4,5,0,3,"Allen, Mr. William",male,35.0,8.0500
5,6,0,3,"Moran, Mr. James",male,NaN,8.4583
6,7,0,1,"McCarthy, Mr. Timothy",male,54.0,51.8625
7,8,0,3,"Palsson, Master. Gosta",male,2.0,21.0750
8,9,1,3,"Johnson, Mrs. Oscar",female,27.0,11.1333
9,10,1,2,"Nasser, Mrs. Nicholas",female,14.0,30.0708

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  10 non-null     int64
 1   Survived     10 non-null     int64
 2   Pclass       10 non-null     int64
 3   Name         10 non-null     object
 4   Sex          10 non-null     object
 5   Age          9 non-null      float64
 6   Fare         10 non-null     float64
dtypes: float64(2), int64(3), object(2)
memory usage: 692.0+ bytes

In [12]:
df.describe()

       PassengerId   Survived     Pclass        Age       Fare
count     10.00000  10.000000  10.000000   9.000000  10.000000
mean       5.50000   0.500000   2.300000  28.111111  27.020820
std        3.02765   0.527046   0.948683  14.945271  23.601938
min        1.00000   0.000000   1.000000   2.000000   7.250000
25%        3.25000   0.000000   1.250000  22.000000   8.152075
50%        5.50000   0.500000   3.000000  27.000000  16.104150
75%        7.75000   1.000000   3.000000  35.000000  46.414575
max       10.00000   1.000000   3.000000  54.000000  71.283300

In [14]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            1
Fare           0
dtype: int64

In [16]:
df.isnull()

   PassengerId  Survived  Pclass   Name    Sex    Age   Fare
0        False     False   False  False  False  False  False
1        False     False   False  False  False  False  False
2        False     False   False  False  False  False  False
3        False     False   False  False  False  False  False
4        False     False   False  False  False  False  False
5        False     False   False  False  False   True  False
6        False     False   False  False  False  False  False
7        False     False   False  False  False  False  False
8        False     False   False  False  False  False  False
9        False     False   False  False  False  False  False

In [20]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
Fare           float64
dtype: object

In [26]:
df[df['Survived'] == 1]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare
1,2,1,1,"Cumings, Mrs. John",female,38.0,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques",female,35.0,53.1000
8,9,1,3,"Johnson, Mrs. Oscar",female,27.0,11.1333
9,10,1,2,"Nasser, Mrs. Nicholas",female,14.0,30.0708

In [28]:
df[(df['Age'] < 30)&(df['Pclass'] == 1)&(df['Sex'] == 'female')]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, Fare]
Index: []

In [30]:
mean_fare = df['Fare'].mean()
df[df['Fare'] > mean_fare]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare
1,2,1,1,"Cumings, Mrs. John",female,38.0,71.2833
3,4,1,1,"Futrelle, Mrs. Jacques",female,35.0,53.1000
6,7,0,1,"McCarthy, Mr. Timothy",male,54.0,51.8625
9,10,1,2,"Nasser, Mrs. Nicholas",female,14.0,30.0708

In [34]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Fare'], dtype='object')

In [36]:
df.rename(columns = {'Sex':'Gender'},inplace = True)

In [38]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Gender', 'Age', 'Fare'], dtype='object')

In [44]:
df.rename(columns = {'PassengerId' : 'ID','Pclass' : 'Class'}, inplace = True)

In [46]:
df.columns

Index(['ID', 'Survived', 'Class', 'Name', 'Gender', 'Age', 'Fare'], dtype='object')

In [48]:
df['Fare']

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
5     8.4583
6    51.8625
7    21.0750
8    11.1333
9    30.0708
Name: Fare, dtype: float64

In [52]:
df[['Class','Fare','ID']]

   Class     Fare  ID
0      3   7.2500   1
1      1  71.2833   2
2      3   7.9250   3
3      1  53.1000   4
4      3   8.0500   5
5      3   8.4583   6
6      1  51.8625   7
7      3  21.0750   8
8      3  11.1333   9
9      2  30.0708  10

In [54]:
df.loc[0]

ID                         1
Survived                   0
Class                      3
Name        Braund, Mr. Owen
Gender                  male
Age                     22.0
Fare                    7.25
Name: 0, dtype: object

In [67]:
df.loc[0,'Name']

'Braund, Mr. Owen'

In [56]:
df.loc[0,'Name']

'Braund, Mr. Owen'

In [65]:
df.loc[0:3,['Name','Fare']]

                     Name     Fare
0        Braund, Mr. Owen   7.2500
1      Cumings, Mrs. John  71.2833
2  Heikkinen, Miss. Laina   7.9250
3  Futrelle, Mrs. Jacques  53.1000

In [69]:
df.iloc[0]

ID                         1
Survived                   0
Class                      3
Name        Braund, Mr. Owen
Gender                  male
Age                     22.0
Fare                    7.25
Name: 0, dtype: object

In [71]:
df.iloc[0:5,3:5]

                     Name  Gender
0        Braund, Mr. Owen    male
1      Cumings, Mrs. John  female
2  Heikkinen, Miss. Laina  female
3  Futrelle, Mrs. Jacques  female
4      Allen, Mr. William    male

In [73]:
df.loc[0:5,'Survived']

0    0
1    1
2    1
3    1
4    0
5    0
Name: Survived, dtype: int64

In [75]:
df.isnull().sum()

ID          0
Survived    0
Class       0
Name        0
Gender      0
Age         1
Fare        0
dtype: int64

In [79]:
mean_age = df['Age'].mean()
df['Age'].fillna(mean_age,inplace = True)

/var/folders/kg/x06_gdsn4vb5n69lwzzp3_nr0000gn/T/ipykernel_4647/226366394.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(mean_age,inplace = True)

In [81]:
df.isnull().sum()

ID          0
Survived    0
Class       0
Name        0
Gender      0
Age         0
Fare        0
dtype: int64

In [83]:
df['Age']

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    28.111111
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [85]:
mean_age

28.111111111111107

In [87]:
df.to_csv('cleaned_titanic.csv',index = False)